app/views/posts/index.html.erb

          <ul class="list-unstyled">
          <% post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 11]]