app/controllers/comments_controller.rb

  def create
    @comment = @post.comments.new(comment_params)
    @comment.user_id = current_user.id
    @comment.save
---
INSERT INTO "comments" ("user_id", "post_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["post_id", 10], ["content", "wow"], ["created_at", 2017-01-08 04:45:17 UTC], ["updated_at", 2017-01-08 04:45:17 UTC]]

  def destroy
    @comment = @post.comments.find(params[:id])
    @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 11], ["id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]