app/controllers/posts_controller.rb

INSERT INTO "posts" ("caption", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "restaurant", "location", "menu", "price") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post = current_user.posts.new(post_params)
    @post.save

UPDATE "posts" SET "caption" = ?, "restaurant" = ?, "location" = ?, "menu" = ?, "price" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["caption", "sadasda"], ["restaurant", "sadasd"], ["location", "asdasd"], ["menu", "asdasd"], ["price", "sdasd"], ["updated_at", 2017-01-11 02:26:26 UTC], ["id", 31]]
---
  def update
    @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def destroy
    @post.image = nil
    @post.save
    @post.destroy